{"keras_version": "1.2.0", "config": [{"config": {"nb_filter": 24, "bias": true, "batch_input_shape": [null, 80, 160, 1], "subsample": [2, 2], "nb_row": 5, "activation": "relu", "name": "convolution2d_1", "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "bias": true, "subsample": [2, 2], "nb_row": 5, "activation": "relu", "name": "convolution2d_2", "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "bias": true, "subsample": [2, 2], "nb_row": 5, "activation": "relu", "name": "convolution2d_3", "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "bias": true, "subsample": [1, 1], "nb_row": 3, "activation": "relu", "name": "convolution2d_4", "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "nb_col": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "bias": true, "subsample": [1, 1], "nb_row": 3, "activation": "relu", "name": "convolution2d_5", "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "nb_col": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "b_constraint": null, "output_dim": 1164, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 2496, "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "b_constraint": null, "output_dim": 100, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 1164, "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"bias": true, "b_constraint": null, "output_dim": 50, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 100, "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"bias": true, "b_constraint": null, "output_dim": 10, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 50, "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"bias": true, "b_constraint": null, "output_dim": 1, "activation": "linear", "name": "dense_5", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 10, "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}