{"config": [{"config": {"input_dtype": "float32", "bias": true, "border_mode": "valid", "nb_filter": 24, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_col": 5, "nb_row": 5, "trainable": true, "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 3], "b_constraint": null, "W_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "valid", "nb_filter": 36, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_col": 5, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "valid", "nb_filter": 48, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_col": 5, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "b_constraint": null, "W_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "valid", "nb_filter": 64, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_col": 3, "trainable": true, "init": "glorot_uniform", "nb_row": 3, "b_constraint": null, "W_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "valid", "nb_filter": 64, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_col": 3, "trainable": true, "init": "glorot_uniform", "nb_row": 3, "b_constraint": null, "W_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 1164, "bias": true, "input_dim": 2496, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 100, "bias": true, "input_dim": 1164, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 50, "bias": true, "input_dim": 100, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_3", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 10, "bias": true, "input_dim": 50, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_4", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "bias": true, "input_dim": 10, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_5", "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}