{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 24, "b_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 80, 160, 1], "activity_regularizer": null, "activation": "relu", "subsample": [2, 2], "bias": true, "nb_col": 5, "input_dtype": "float32", "name": "convolution2d_1", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 36, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "activation": "relu", "subsample": [2, 2], "bias": true, "nb_col": 5, "name": "convolution2d_2", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 48, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "activation": "relu", "subsample": [2, 2], "bias": true, "nb_col": 5, "name": "convolution2d_3", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "name": "convolution2d_4", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "name": "convolution2d_5", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 2496, "activation": "linear", "name": "dense_1", "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 1164, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 1164, "activation": "linear", "name": "dense_2", "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 100, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 100, "activation": "linear", "name": "dense_3", "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 50, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 50, "activation": "linear", "name": "dense_4", "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 10, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 10, "activation": "linear", "name": "dense_5", "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform"}}], "keras_version": "1.2.0"}