{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "nb_col": 5, "name": "convolution2d_1", "border_mode": "valid", "W_regularizer": null, "input_dtype": "float32", "bias": true, "b_regularizer": null, "nb_row": 5, "activity_regularizer": null, "nb_filter": 24, "batch_input_shape": [null, 80, 160, 1], "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "nb_col": 5, "name": "convolution2d_2", "nb_row": 5, "border_mode": "valid", "bias": true, "b_regularizer": null, "nb_filter": 36, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "nb_col": 5, "name": "convolution2d_3", "nb_row": 5, "border_mode": "valid", "bias": true, "b_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "nb_col": 3, "name": "convolution2d_4", "nb_row": 3, "border_mode": "valid", "bias": true, "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "nb_col": 3, "name": "convolution2d_5", "nb_row": 3, "border_mode": "valid", "bias": true, "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1164, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "input_dim": 2496, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "input_dim": 1164, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "init": "glorot_uniform", "b_constraint": null, "name": "dense_3", "input_dim": 100, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "init": "glorot_uniform", "b_constraint": null, "name": "dense_4", "input_dim": 50, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "init": "glorot_uniform", "b_constraint": null, "name": "dense_5", "input_dim": 10, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true}}]}